In [1]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
import pandas as pd

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "hr"
connection = f"mysql+pymysql://{username}:{password}@localhost/hr"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_hr
0   department
1     employee
2          job
3  job_history

In [4]:
q = """SELECT * FROM employee"""
pd.read_sql(q, conn)

Empty DataFrame
Columns: [EMP_ID, F_NAME, L_NAME, SSN, B_DATE, SEX, ADDRESS, JOB_ID, SALARY, MANAGER_ID, DEP_ID, created_at, updated_at]
Index: []

In [5]:
# Read in the employee data and preview
employees = pd.read_csv('Raw Data/Employee-data.csv')
employees.info()
employees.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  8 non-null      object
 1   f_name       8 non-null      object
 2   l_name       8 non-null      object
 3   ssn          8 non-null      int64
 4   birth_date   8 non-null      object
 5   sex          8 non-null      object
 6   address      8 non-null      object
 7   job_id       8 non-null      int64
 8   salary       8 non-null      int64
 9   manager_id   8 non-null      int64
 10  dep_id       8 non-null      int64
dtypes: int64(5), object(6)
memory usage: 832.0+ bytes

,employee_id,f_name,l_name,ssn,birth_date,sex,address,job_id,salary,manager_id,dep_id
0,E1001,John,Thomas,123456,01/09/1976,M,"5631 Rice, OakPark,IL",100,100000,30001,2
1,E1002,Alice,James,123457,07/31/1972,F,"980 Berry ln, Elgin,IL",200,80000,30002,5
2,E1003,Steve,Wells,123458,08/10/1980,M,"291 Springs, Gary,IL",300,50000,30002,5
3,E1004,Santosh,Kumar,123459,07/20/1985,M,"511 Aurora Av, Aurora,IL",400,60000,30004,5
4,E1005,Ahmed,Hussain,123410,01/04/1981,M,"216 Oak Tree, Geneva,IL",500,70000,30001,2

# Comparing and Preparing the Data

**Preparing data with Pandas**

To upload data to the pre-existing EMPLOYEE table we need to make sure the col names and data types of our DataFrame are compatible with the table's names and dtypes. Use DESCRIBE TABLE to learn about a specific table.

In [6]:
q = """DESCRIBE employee"""
describe = pd.read_sql(q, conn)
describe

,Field,Type,Null,Key,Default,Extra
0,EMP_ID,varchar(9),NO,PRI,None,
1,F_NAME,varchar(45),YES,,None,
2,L_NAME,varchar(45),YES,,None,
3,SSN,char(9),YES,,None,
4,B_DATE,date,YES,,None,
5,SEX,char(1),YES,,None,
6,ADDRESS,varchar(45),YES,,None,
7,JOB_ID,char(9),NO,MUL,None,
8,SALARY,"decimal(10,2)",YES,,None,
9,MANAGER_ID,char(9),YES,,None,
10,DEP_ID,char(9),YES,MUL,None,
11,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
12,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

The result of DESCRIBE provides a lot of information.

For each column, it tells us:

the field/column name
the datatype, including size
Whether Null values are permitted
If the column serves as a key. It could be:
    PRI: Primary Key
    UNI: A unique key, but not set as the primary key.
    MUL: Foreign key with multiple matches
the Default Value:
    Note that created_at and updated_at both have "CURRENT_TIMESTAMP" as the Default.
Extra commands/notes.
    Note that the updated_at field indicates that it will be updated with the current timestamp when modified.

This information will ensure our DataFrame has the correct field names and datatypes before inserting the data into our pre-existing database.sting database.

**Checking Field/Column Names**

Let's check expected Field names and dtypes for this table.
Let's inspect the names of the fields in the database and compare them to the cols in our DataFrame.

In [7]:
# Checking describe's Field names
describe['Field'].values

array(['EMP_ID', 'F_NAME', 'L_NAME', 'SSN', 'B_DATE', 'SEX', 'ADDRESS',
       'JOB_ID', 'SALARY', 'MANAGER_ID', 'DEP_ID', 'created_at',
       'updated_at'], dtype=object)

In [8]:
# Checking dataframe's columns
employees.columns

Index(['employee_id', 'f_name', 'l_name', 'ssn', 'birth_date', 'sex',
       'address', 'job_id', 'salary', 'manager_id', 'dep_id'],
      dtype='object')

It looks like all the DF's col names are lowercase, but the DB has uppercase.
- We will convert our df cols to upper.

We also see that 'EMP_ID' col in DB is called 'employee_id' in DF, and 'B_DATE' col in DB is called 'birth_date' in DF.
- We will rename our df cols to match the DB.

In [9]:
# Convert col names to uppercase using .str.upper()
employees.columns.str.upper()

Index(['EMPLOYEE_ID', 'F_NAME', 'L_NAME', 'SSN', 'BIRTH_DATE', 'SEX',
       'ADDRESS', 'JOB_ID', 'SALARY', 'MANAGER_ID', 'DEP_ID'],
      dtype='object')

In [11]:
# Replace original col names
employees.columns = employees.columns.str.upper()
employees.head(2)

,EMPLOYEE_ID,F_NAME,L_NAME,SSN,BIRTH_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
0,E1001,John,Thomas,123456,01/09/1976,M,"5631 Rice, OakPark,IL",100,100000,30001,2
1,E1002,Alice,James,123457,07/31/1972,F,"980 Berry ln, Elgin,IL",200,80000,30002,5

In [12]:
# Rename cols to match SQL table
rename_map = {'EMPLOYEE_ID':'EMP_ID',
              'BIRTH_DATE':'B_DATE'}
employees = employees.rename(rename_map, axis=1)
employees.head(2)

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
0,E1001,John,Thomas,123456,01/09/1976,M,"5631 Rice, OakPark,IL",100,100000,30001,2
1,E1002,Alice,James,123457,07/31/1972,F,"980 Berry ln, Elgin,IL",200,80000,30002,5

**Check Field/Column Dtypes**

- Next, compate dtypes of database vs our dataframe. Note that dtypes will not be an exact match but a general match. For instance SQL's VARCHAR is equivalent to 'object' or 'string'

In [13]:
# Review SQL table's dtypes
describe[['Field', 'Type']]

         Field           Type
0       EMP_ID     varchar(9)
1       F_NAME    varchar(45)
2       L_NAME    varchar(45)
3          SSN        char(9)
4       B_DATE           date
5          SEX        char(1)
6      ADDRESS    varchar(45)
7       JOB_ID        char(9)
8       SALARY  decimal(10,2)
9   MANAGER_ID        char(9)
10      DEP_ID        char(9)
11  created_at       datetime
12  updated_at       datetime

In [14]:
# Review dataframe's dtypes
employees.dtypes

EMP_ID        object
F_NAME        object
L_NAME        object
SSN            int64
B_DATE        object
SEX           object
ADDRESS       object
JOB_ID         int64
SALARY         int64
MANAGER_ID     int64
DEP_ID         int64
dtype: object

- We see B_DATE is an object but needs to be a datetime.

In [16]:
# Convert B_DATE to datetime dtype
employees['B_DATE'] = pd.to_datetime(employees['B_DATE'])
employees.dtypes

EMP_ID                object
F_NAME                object
L_NAME                object
SSN                    int64
B_DATE        datetime64[ns]
SEX                   object
ADDRESS               object
JOB_ID                 int64
SALARY                 int64
MANAGER_ID             int64
DEP_ID                 int64
dtype: object

# Inserting the Values into the Table

If we were using pure SQL to add our data, we would have to construct "INSERT" commands.

The syntax for insertion commands is:
INSERT INTO table_name (Col1,Col2,Col3)
VALUES (val1,val2,val3);

We would need to create a row of values for every row in our dataframe.
INSERT INTO EMPLOYEE (EMP_ID, F_NAME, L_NAME)
VALUES
     ("E001", "John" ,"Smith"),
    ("E002", "Fatima" ,"Silva"),
    ("E003", "Mary" ,"Abrams");

Thankfully, we can use SqlAlchemy and Pandas to accomplish this instead with less code.

**df.to_sql**

- Just as Pandas has both pd.read_csv() and df.to_csv, it also has pd.read_sql() AND a df.to_sql() method.

- We will use the .to_sql method to add our data but we must make sure to select the correct arguments for the task.

**pandas.DataFrame.to_sql**

**DataFrame.to_sql(name, con, schema=None, if_exists='fail', index=True,
    index_label=None, chunksize=None, dtype=None, method=None)**

    - name: needs the name of the table to insert the data into
    - con: needs the connection to the database from sqlalchemy
    - schema: doesn't require that we specify a schema for MySQL
    - if_exists: by default, if our table already exists, it will faill and we will get an error.
        - We DONT want this, we want to add data TO the table if it exists
        - options for if_exists are:
            - fail: raise a ValueError
            - replace: drop the table before inserting new values
            - append: insert new values to existing table
        - We want to add data, so we will use if_exists='append'
    - index: it includes the DF index as a column for the database
        - We generally want to have a plain pandas integer index for our DF and so use index=False

## Inserting Data into the EMPLOYEE Table

In [20]:
# employees.to_sql("employee",conn,index=False, if_exists='append')

- This code throws an error relating to Foreign Key Constraint checks, so we have to modify a parameter in the DB.

In [21]:
# Checking the settings for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     1

- To deactivate checks, set to 0.

In [24]:
# Changing the setting for FOREIGN_KEY_CHECKS with pd.read_sql

# q = """SET @@FOREIGN_KEY_CHECKS=0"""
# pd.read_sql(q,conn)

- This will still give us an error. Sqlalchemy automatically closed our connection due to the error. To get around it, we use the connection itself to conn.execute() the query

**When we need to run a query that does not return data, we will need to use the connection object to .execute the query instead of using pd.read.sql**

In [26]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [27]:
# Confirm the checks are deactivated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, conn)

   @@FOREIGN_KEY_CHECKS
0                     0

- Now that we have deactivated the checks (value = 0) we can try the to_sql command again.

In [29]:
# Inserting the data now that foreign key checks are disabled
employees.to_sql('employee', conn, index=False, if_exists='append')

8

In [30]:
# Confirm the data has been added
q = """SELECT * FROM employee"""
pd.read_sql(q, conn)

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID,created_at,updated_at
0,E1001,John,Thomas,123456,1976-01-09,M,"5631 Rice, OakPark,IL",100,100000.0,30001,2,2023-10-27 01:12:13,2023-10-27 01:12:13
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000.0,30002,5,2023-10-27 01:12:13,2023-10-27 01:12:13
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000.0,30002,5,2023-10-27 01:12:13,2023-10-27 01:12:13
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000.0,30004,5,2023-10-27 01:12:13,2023-10-27 01:12:13
4,E1005,Ahmed,Hussain,123410,1981-01-04,M,"216 Oak Tree, Geneva,IL",500,70000.0,30001,2,2023-10-27 01:12:13,2023-10-27 01:12:13
5,E1006,Nancy,Allen,123411,1978-02-06,F,"111 Green Pl, Elgin,IL",600,90000.0,30001,2,2023-10-27 01:12:13,2023-10-27 01:12:13
6,E1007,Mary,Thomas,123412,1975-05-05,F,"100 Rose Pl, Gary,IL",650,65000.0,30003,7,2023-10-27 01:12:13,2023-10-27 01:12:13
7,E1008,Bharath,Gupta,123413,1985-05-06,M,"145 Berry Ln, Naperville,IL",660,65000.0,30003,7,2023-10-27 01:12:13,2023-10-27 01:12:13

- We have successfully added 8 rows to the table. Even though we didn't include created_at or updated_at cols, we had set default values so MySQL populated them for us.
- Let's confirm we didn't alter the original data types by checking DESCRIBE table again.

In [31]:
# Check describe again to confirm no changes
q = """DESCRIBE employee;"""
pd.read_sql(q, conn)

,Field,Type,Null,Key,Default,Extra
0,EMP_ID,varchar(9),NO,PRI,None,
1,F_NAME,varchar(45),YES,,None,
2,L_NAME,varchar(45),YES,,None,
3,SSN,char(9),YES,,None,
4,B_DATE,date,YES,,None,
5,SEX,char(1),YES,,None,
6,ADDRESS,varchar(45),YES,,None,
7,JOB_ID,char(9),NO,MUL,None,
8,SALARY,"decimal(10,2)",YES,,None,
9,MANAGER_ID,char(9),YES,,None,
10,DEP_ID,char(9),YES,MUL,None,
11,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
12,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

- We have not altered any original dtypes.

** Duration of changes to database settings**

- We have only changed the FOREIGN_KEY_CHECK for our current session/connection, and if we close or delete the connection and engine and create fresh ones, we can verify the value has returned to 1.

In [33]:
# Closing the connection
conn.close()
# Deleting the engine and connection
del engine, conn

In [35]:
# Creating new engine and connection
engine = create_engine(connection)
conn = engine.connect()
# Check if the value for foreign key checks has reset to 1
pd.read_sql('SELECT @@FOREIGN_KEY_CHECKS', conn)

   @@FOREIGN_KEY_CHECKS
0                     1

### Duplicate Key Errors

- Let's say you received a new set of data to add to the db. First, let's load in the new file and perform the same processing steps.

In [36]:
# Loading new file and repeating preprocessing/cleaning steps
employees = pd.read_csv("Raw Data/Employee-data-v2.csv")
# replace original column names
employees.columns = employees.columns.str.upper()
# Rename EMPLOYEE_ID to "EMP_ID"
rename_map = {"EMPLOYEE_ID":"EMP_ID",
             "BIRTH_DATE":"B_DATE"}
employees = employees.rename(rename_map, axis=1)
# Changing B_DATE to datetime dtype
employees['B_DATE'] = pd.to_datetime(employees['B_DATE'])
employees

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID
0,E1001,John,Thomas,123456,1976-01-09,M,"5631 Rice, OakPark,IL",100,100000,30001,2
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000,30002,5
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000,30002,5
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000,30004,5
4,E1005,Ahmed,Hussain,123410,1981-01-04,M,"216 Oak Tree, Geneva,IL",500,70000,30001,2
5,E1006,Nancy,Allen,123411,1978-02-06,F,"111 Green Pl, Elgin,IL",600,90000,30001,2
6,E1007,Mary,Thomas,123412,1975-05-05,F,"100 Rose Pl, Gary,IL",650,65000,30003,7
7,E1008,Bharath,Gupta,123413,1985-05-06,M,"145 Berry Ln, Naperville,IL",660,65000,30003,7
8,E1009,Andrea,Jones,123414,1990-07-09,F,"120 Fall Creek, Gary,IL",234,70000,30003,7
9,E1010,Ann,Jacob,123415,1982-03-30,F,"111 Britany Springs,Elgin,IL",220,70000,30004,5

- We closed and reopened the connection, so we must again disable foreign key checks.

In [37]:
# Disabling foreign key checks again
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

- We run into a new issue because adding version 2 would result in duplicate primary keys, so we will get an IntegrityError about duplicate entries.

In [40]:
# Attempt the insertion again after deactivating the checks

# employees.to_sql("employee",conn,index=False, if_exists='append')

- Unfortunately if **any** of the primary keys are duplicates, the entire transaction fails, and no rows are added.

In [42]:
# Confirming no new rows have been added
q = """SELECT * FROM employee"""
pd.read_sql(q, conn) # Still only 8 rows

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID,created_at,updated_at
0,E1001,John,Thomas,123456,1976-01-09,M,"5631 Rice, OakPark,IL",100,100000.0,30001,2,2023-10-27 01:12:13,2023-10-27 01:12:13
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000.0,30002,5,2023-10-27 01:12:13,2023-10-27 01:12:13
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000.0,30002,5,2023-10-27 01:12:13,2023-10-27 01:12:13
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000.0,30004,5,2023-10-27 01:12:13,2023-10-27 01:12:13
4,E1005,Ahmed,Hussain,123410,1981-01-04,M,"216 Oak Tree, Geneva,IL",500,70000.0,30001,2,2023-10-27 01:12:13,2023-10-27 01:12:13
5,E1006,Nancy,Allen,123411,1978-02-06,F,"111 Green Pl, Elgin,IL",600,90000.0,30001,2,2023-10-27 01:12:13,2023-10-27 01:12:13
6,E1007,Mary,Thomas,123412,1975-05-05,F,"100 Rose Pl, Gary,IL",650,65000.0,30003,7,2023-10-27 01:12:13,2023-10-27 01:12:13
7,E1008,Bharath,Gupta,123413,1985-05-06,M,"145 Berry Ln, Naperville,IL",660,65000.0,30003,7,2023-10-27 01:12:13,2023-10-27 01:12:13

### Handling Duplicate Key Errors

**Modifying df.to_sql)()**

- So far we have always used if_exists='append' arg. We can change to using if_exists='replace' but it's important to know **this will replace the entire table,** not just the duplicate rows.
- We also cannot add 'replace' alone, as doing so causes us to completely drop the existing table, including specified dtypes.

**Dangers of if_exists='replace'**

In [44]:
# Checking the dtypes before inserting new data
q = """DESCRIBE employee;"""
pd.read_sql(q, conn)

,Field,Type,Null,Key,Default,Extra
0,EMP_ID,varchar(9),NO,PRI,None,
1,F_NAME,varchar(45),YES,,None,
2,L_NAME,varchar(45),YES,,None,
3,SSN,char(9),YES,,None,
4,B_DATE,date,YES,,None,
5,SEX,char(1),YES,,None,
6,ADDRESS,varchar(45),YES,,None,
7,JOB_ID,char(9),NO,MUL,None,
8,SALARY,"decimal(10,2)",YES,,None,
9,MANAGER_ID,char(9),YES,,None,
10,DEP_ID,char(9),YES,MUL,None,
11,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
12,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [45]:
## DONT RUN ##

# Changing if_exists to replace for demonstration
# employees.to_sql('EMPLOYEE', conn, inddex=False, if_exists='replace')

# q = """DESCRIBE EMPLOYEE;"""
# pd.read_sql(q, conn)

- The above code rewrites the dtypes for every single col, throwing the table into disarray.

## Correct method: Specify Dtypes for df.to_sql

**1. Create a data type dictionary**

- SQLAlchemy has a solution to this rewriting issue. There is a 'types' module in sqlalchemy that contains classes for each SQL dtype.
    - We can create a dict with each col as a key, and the corresponding SQL data type class as the value.
    - We then use the dict as the dtype arg in df.to_sql()


- Below is an example:
    - Review our original DESCRIBE EMPLOYEE and we see the following dtypes: varchar(45), char(9), decimal(10,1), date, datetime.
    - Each has a corresponding class in the 'sqlalchemy.types' module

In [46]:
from sqlalchemy.types import VARCHAR, CHAR, DECIMAL, DATE, DATETIME

In [47]:
employee_dtypes  = {'EMP_ID':VARCHAR(9),
                    'F_NAME':VARCHAR(45),
                    'L_NAME':VARCHAR(45),
                    'SSN': CHAR(9),
                    'B_DATE':DATE,
                    'SEX':CHAR(1),
                    'ADDRESS':VARCHAR(45),
                    'JOB_ID':CHAR(9),
                    'SALARY':DECIMAL(10,2),
                    'MANAGER_ID':CHAR(9),
                    'DEP_ID':CHAR(9),
                    'created_at':DATETIME,
                    'updated_at':DATETIME}
employee_dtypes

{'EMP_ID': VARCHAR(length=9),
 'F_NAME': VARCHAR(length=45),
 'L_NAME': VARCHAR(length=45),
 'SSN': CHAR(length=9),
 'B_DATE': sqlalchemy.sql.sqltypes.DATE,
 'SEX': CHAR(length=1),
 'ADDRESS': VARCHAR(length=45),
 'JOB_ID': CHAR(length=9),
 'SALARY': DECIMAL(precision=10, scale=2),
 'MANAGER_ID': CHAR(length=9),
 'DEP_ID': CHAR(length=9),
 'created_at': sqlalchemy.sql.sqltypes.DATETIME,
 'updated_at': sqlalchemy.sql.sqltypes.DATETIME}

**2. Run df.to_sql with the types dict as the dtype arg**
- Make sure index=False

In [48]:
# Changing if_exists to replace to demo consequences.
employees.to_sql("employee",conn, index=False, if_exists='replace',
                dtype=employee_dtypes)
# Checking the describe again
q = """DESCRIBE employee;"""
pd.read_sql(q,conn)

         Field           Type Null Key Default Extra
0       EMP_ID     varchar(9)  YES        None
1       F_NAME    varchar(45)  YES        None
2       L_NAME    varchar(45)  YES        None
3          SSN        char(9)  YES        None
4       B_DATE           date  YES        None
5          SEX        char(1)  YES        None
6      ADDRESS    varchar(45)  YES        None
7       JOB_ID        char(9)  YES        None
8       SALARY  decimal(10,2)  YES        None
9   MANAGER_ID        char(9)  YES        None
10      DEP_ID        char(9)  YES        None

- We have preserved our original dtypes after using if_exists='replace' by providing a dictionary.
- Notice we no longer have 'created_at' or 'updated_at' cols. Even though we included them in the dict, we didn't have any cols in the dataframe, so they weren't created.

### Adding back created_at and updated_at

- We can add these back by using ALTER TABLE commands. We will add the cols and then specify default values we used for the ERDs in the MySQL Workbench lesson.

In [49]:
q = """ALTER TABLE employee ADD created_at DATETIME DEFAULT NOW()"""
conn.execute(q)

In [50]:
q = """ALTER TABLE employee ADD updated_at DATETIME DEFAULT NOW() ON UPDATE NOW();"""
conn.execute(q)

- Let's query the employee table one last time to confirm we have added the 2 new cols and that we have added more than our original 8 rows from the first csv file.

In [51]:
q = """SELECT * FROM employee;"""
pd.read_sql(q, conn)

,EMP_ID,F_NAME,L_NAME,SSN,B_DATE,SEX,ADDRESS,JOB_ID,SALARY,MANAGER_ID,DEP_ID,created_at,updated_at
0,E1001,John,Thomas,123456,1976-01-09,M,"5631 Rice, OakPark,IL",100,100000.0,30001,2,2023-10-27 01:39:19,2023-10-27 01:39:53
1,E1002,Alice,James,123457,1972-07-31,F,"980 Berry ln, Elgin,IL",200,80000.0,30002,5,2023-10-27 01:39:19,2023-10-27 01:39:53
2,E1003,Steve,Wells,123458,1980-08-10,M,"291 Springs, Gary,IL",300,50000.0,30002,5,2023-10-27 01:39:19,2023-10-27 01:39:53
3,E1004,Santosh,Kumar,123459,1985-07-20,M,"511 Aurora Av, Aurora,IL",400,60000.0,30004,5,2023-10-27 01:39:19,2023-10-27 01:39:53
4,E1005,Ahmed,Hussain,123410,1981-01-04,M,"216 Oak Tree, Geneva,IL",500,70000.0,30001,2,2023-10-27 01:39:19,2023-10-27 01:39:53
5,E1006,Nancy,Allen,123411,1978-02-06,F,"111 Green Pl, Elgin,IL",600,90000.0,30001,2,2023-10-27 01:39:19,2023-10-27 01:39:53
6,E1007,Mary,Thomas,123412,1975-05-05,F,"100 Rose Pl, Gary,IL",650,65000.0,30003,7,2023-10-27 01:39:19,2023-10-27 01:39:53
7,E1008,Bharath,Gupta,123413,1985-05-06,M,"145 Berry Ln, Naperville,IL",660,65000.0,30003,7,2023-10-27 01:39:19,2023-10-27 01:39:53
8,E1009,Andrea,Jones,123414,1990-07-09,F,"120 Fall Creek, Gary,IL",234,70000.0,30003,7,2023-10-27 01:39:19,2023-10-27 01:39:53
9,E1010,Ann,Jacob,123415,1982-03-30,F,"111 Britany Springs,Elgin,IL",220,70000.0,30004,5,2023-10-27 01:39:19,2023-10-27 01:39:53

- We successfully updated the first table in our database using Python while maintaining the dtypes and default values we constructed in MySQL Workbench.
- Remember to close the connection when finished working.

In [52]:
# Closing the connection
conn.close()

## SUMMARY

- This lesson demonstrated how you can access and add data to a database that was originally created in MySQL workbench.
- You are working towards the ability to work within Python or MySQL Workbench, depending on your needs and preferences.
    - Remember to be aware of foreign key constraints and disable them to avoid an error.
    - Ensure that your dataframe has matching names and datatypes appropriate for the SQL table.
    - Also, remember to create a data types dictionary to ensure your datatypes are added correctly when adding data to the table.